In [2]:
import pandas as pd

In [3]:
grades_dict = {'Wally': [100,98,76], 'Eva': [84,75,99]}

In [4]:
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva
0    100   84
1     98   75
2     76   99

In [5]:
grades.index = ['Test1','Test2','Test3']

In [6]:
grades

       Wally  Eva
Test1    100   84
Test2     98   75
Test3     76   99

In [7]:
grades['Eva']

Test1    84
Test2    75
Test3    99
Name: Eva, dtype: int64

In [8]:
grades.Wally

Test1    100
Test2     98
Test3     76
Name: Wally, dtype: int64

In [9]:
grades.loc['Test1']

Wally    100
Eva       84
Name: Test1, dtype: int64

In [10]:
grades.iloc[0]

Wally    100
Eva       84
Name: Test1, dtype: int64

In [11]:
grades.loc['Test1':'Test3']

       Wally  Eva
Test1    100   84
Test2     98   75
Test3     76   99

In [12]:
grades.iloc[0:2]

       Wally  Eva
Test1    100   84
Test2     98   75

In [13]:
grades.loc[['Test1','Test3']]

       Wally  Eva
Test1    100   84
Test3     76   99

In [14]:
grades.iloc[[0,2]]

       Wally  Eva
Test1    100   84
Test3     76   99

In [15]:
grades.loc['Test1':'Test3', ['Eva', 'Wally']]

       Eva  Wally
Test1   84    100
Test2   75     98
Test3   99     76

In [16]:
grades.iloc[[0,2], 0:3]

       Wally  Eva
Test1    100   84
Test3     76   99

In [17]:
grades[grades>=90]

       Wally   Eva
Test1  100.0   NaN
Test2   98.0   NaN
Test3    NaN  99.0

In [23]:
grades[(grades>=80)&(grades<90)]

       Wally  Eva
Test1    NaN  NaN
Test2    NaN  NaN
Test3    NaN  NaN

In [18]:
grades.at['Test1','Eva']

np.int64(84)

In [19]:
grades.iat[0,0]

np.int64(100)

In [20]:
grades.at['Test1','Eva'] = 100

In [21]:
grades.describe()

            Wally         Eva
count    3.000000    3.000000
mean    91.333333   91.333333
std     13.316656   14.153916
min     76.000000   75.000000
25%     87.000000   87.000000
50%     98.000000   99.000000
75%     99.000000   99.500000
max    100.000000  100.000000

In [22]:
pd.set_option('precision', 2)

OptionError: 'Pattern matched multiple keys'

In [27]:
grades.mean()

Wally    91.333333
Eva      91.333333
dtype: float64

In [28]:
grades.T

       Test1  Test2  Test3
Wally    100     98     76
Eva      100     75     99

In [29]:
grades.T.describe()

       Test1      Test2      Test3
count    2.0   2.000000   2.000000
mean   100.0  86.500000  87.500000
std      0.0  16.263456  16.263456
min    100.0  75.000000  76.000000
25%    100.0  80.750000  81.750000
50%    100.0  86.500000  87.500000
75%    100.0  92.250000  93.250000
max    100.0  98.000000  99.000000

In [30]:
grades.sort_index(ascending=False)

       Wally  Eva
Test3     76   99
Test2     98   75
Test1    100  100

In [31]:
grades.sort_index(axis=1)

       Eva  Wally
Test1  100    100
Test2   75     98
Test3   99     76

In [32]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Wally  Eva
Test1    100  100
Test2     98   75
Test3     76   99

In [34]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Wally    100     98     76
Eva      100     75     99

In [36]:
grades.loc['Test1'].sort_values(ascending=False)

Wally    100
Eva      100
Name: Test1, dtype: int64